---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArray.ForwardIterator
source: html/593d1eca-d0c9-ed33-2028-42971302435a.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual VertexIndexPairArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.